tap "homebrew/bundle"
tap "homebrew/services"

# Utilities
brew "cheat"
brew "tree"
brew "tldr"
brew "trash" #CLI tool that moves files or folder to the trash
brew "upgrep"
brew "bat"
brew "bat-extras"
brew "eza"
brew "fish"
brew "fisher"

# Programming Language Tools
## C++ Development
brew "gcc"
brew "clang-format"
brew "catch2"

## Ruby
brew "rbenv"
#brew "ruby-build"
#brew "libyaml"

## Python
brew "pyenv"
#brew "xz"

## Shell
brew "shfmt" # Autoformat shell script source code
brew "shellcheck" # Static analysis tool for shell scripts

# Applications not in Mac App Store
#cask "google-chrome"
cask "visual-studio-code"
vscode "AngaBlue.asm-formatter"
vscode "chipsalliance.verible"
vscode "cschlosser.doxdocgen"
vscode "dksedgwick.xstviz"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "hediet.debug-visualizer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kdarkhan.mips"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "PenumbraTheme.penumbra"
vscode "Rickaym.manim-sideview"
vscode "teros-technology.teroshdl"
vscode "timonwong.shellcheck"
vscode "tzylee.verilog-highlight"
vscode "Willumz.generic-pseudocode"

##### Productivity
cask "rectangle"
cask "breaktimer"
cask "alt-tab"
cask "shottr"
cask "obsidian"
cask "mullvad-browser"
cask "mimestream"
cask "discord"
cask "arc"
cask "maccy"
# Maybe ReadWise to save highlights from books, articles, etc
# But only if PopClip seems useful. So far, the only thing that seems useful is the copy as Markdown
# The ChatGPT extensions for PopClip doesn't seem all that great.
# Install UseMotion
# Install Eagle, then restore from backup, located in Photos directory


# AI Tools
# Bolt AI because it's beautiful
# Intellibar because it's a menu bar that you can copy and paste into anything
# Quartzite AI because it manages Prompts
# HyperKey for remapping shortcuts
##### Calculator
# Soulver or Numi Or Calca (Calca show's Half Adder in screenshot, so might be best option)
# Soulver has multiple sheets, so has lots of organization
# Numi is newest and has the newest UI

#### Applications not needed for our testing purposes yet
# cask "adobe-acrobat-pro"
# cask "iina" # Replaces VLC
# cask "zoom"
# cask "transmission"
# cask "cyberduck"
# cask "skype" 
# cask "anylist"
# cask "kap" # Screen recording but screenity chrome extension might be better

#### CS 233
# brew "icarus-verilog"
# brew "verible" #Fix This
# brew "bit-fiddle" # Not sure about
# cask "gtkwave"

### CS 225
cask "docker"



### Manim Animation
# brew "ffmpeg"
# brew "pango" 
# brew "pkg-config"
# brew "qt5"
# brew "py3cairo" # pip install pycairo
# brew "scipy" # pip install scipy
# cask "mactex-no-gui"

# brew "d2" # Diagramming tool


